export default {
  data() {
    return {
      listResons: {
        1:	"1 а/п",
        2	: "перегон",
        3	: "отсутствие грязного, нет крана",
        4	: "отсутствие грязного, нет а/м",
        5	: "нет места под чистый, нет крана",
        6	: "перекрыт ж/д переезд, маневровая работа",
        7	: "поломка а/п",
        8	: "смерзшийся уголь",
        9	: "нет топлива",
        10:	"уголь с вагонов",
        11:	"зачистка бункера",
        12:	"пыление",
        13:	"зона работы крана",
        14:	"ТО",
        15:	"Прочее",
        16:	"магнит",
        17:	"бункер",
        18:	"конвейер",
        19:	"Валки/грохот",
        20:	"передвижение",
        21:	"электрика",
        22:	"перекрыт подъезд к УСМ SENNEBOGEN",
        23:	"перекрыт подъезд к УСМ",
        24:	"зачистка УСМ",
        25:	"подготовка места под УСМ",
        26:	"навешивание пологов",
        27:	"поломка крана",
        28:	"маневровые работы",
        29:	"НМУ",
        30:	"отсутствие груза",
        37: "отсутствие а/п", 
        38: "перерыв", 
        undefined: "не ещё" 
      }
    }
  },
  methods: {
    getIcon(reson) {
      let fileName
      try {
          fileName = require('@/assets/img/resons/'+reson+'.svg')
        } catch (e) {
          fileName = require('@/assets/img/resons/0.svg') 
        }
      return fileName
    }
  }
}
